app/controllers/pins_controller.rb

  def index
    @pins = Pin.all
---
SELECT "pins".* FROM "pins"

  def show
    @pin = Pin.find(params[:id])
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT 1  [["id", 1]]